KC5-BP/C8051F020-WS2812B/Matrix/ws2812_matrix.c
/*..-----------------------------------------------------------------------------------.
../ .---------------------------------------------------------------------------------. \
./´/
|x| __--""'\
|x|  ,__  -'""`;
|x| /   \  /"'  \
|x|   __// \-"-_/
|x| ´"   \  |           > Title : ws2812_strip
|x| \     |  \  _.-"',
|x| "^,-´\/\  '" ,--. \         > Src : Timers_Wait_Xms.c
|x|  \|\| | | , /    | |        >           (One of my own first c file)
|x|     '`'\|._ |   / /
|x|         '\),/  / |          > Creation: 2019.11.21
|x|           |/.-"_/           > By :  KC5-BP
|x| .__---+-_/'|--"
|x|         _| |_--,            > Description :
|x|        ',/ |   /                Declarations of RGB's ws2812b LEDs usage funct. .
|x|        /|| |  /
|x|     |\| |/ |- |
|x| .-,-/ | /  '/-"
|x| -\|/-/\/ ^,'|
|x| _-     |  |/
|x|  .  --"  /
|x| /--__,.-/
.\`\__________________________________________________________________________________/´/
..`____________________________________________________________________________________´
========================================================================================>
=======================================================================================*/
// Linker to : ..
// .. definition folder SFR (Like Port Definition "P5", "P6", TR0, etc...)
#include <c8051f020.h>
// .. created header for ws2812b functions usage.
#include "ws2812_matrix.h"
// .. character's definitions.
#include "kc5_bp_matrix_alphanum.h"

//-- GLOBAL VARIABLES INIT : ----------------------------->
//xdata pixel matrix[MAX_LEDS] = {{0, 0, 0}, 0, 0, 0};    // Initialize everything to 0.
xdata pixel matrix[MAX_LEDS] = {{0, 0, 0}, 0, 0};    // Initialize everything to 0.
xdata offsetText Offset = {0, 0};                   // Init. column + line to 0.
xdata matrixFormat matrixDisplay = {0, 0};      // Init. matrixView + txtFont to 0.

//-------------------------------------------------------------------------------------->
void pixel_Set(pixel* addressMatrix, color newColor, posType position)
{   // "position" validity ..
    if(position < MAX_LEDS)
    {   // Go to the wanted LED position.
        addressMatrix += position;

        // Set "color" values :
        addressMatrix->colorPix = newColor;

        // Set the status to ON if color different of "black" :
        if ( (newColor.Red == BRIGHT_MIN)
             && (newColor.Green == BRIGHT_MIN)
             && (newColor.Blue == BRIGHT_MIN) )
        {   // Complement : " == " operator not possible on a complete struct in C.
            addressMatrix->status = 0;
        }
        else
        {
            addressMatrix->status = 1;
        }
    }
}

void pixel_Reset(pixel* addressMatrix, posType position)
{   // Var. Dec. :
    xdata const color BLACK = {0, 0, 0};

    // "position" validity ..
    if(position < MAX_LEDS)
    {   // Go to the wanted LED position.
        addressMatrix += position;
        // Set "color" values to black.
        addressMatrix->colorPix = BLACK;
        // Set status to '0' (OFF).
        addressMatrix->status = 0;
    }
}

color pixel_GetColor(pixel* addressMatrix, posType position)
{
    return (addressMatrix + position)->colorPix;
}

unsigned char pixel_GetStatus(pixel* addressMatrix, posType position)
{
    return (addressMatrix + position)->status;
}

void pixel_ToggleStatus(pixel* addressMatrix, posType position)
{   // "position" validity ..
    if(position < MAX_LEDS)
    {   // Go to the wanted LED position.
        addressMatrix += position;

        if (addressMatrix->status != 0)
        {   // Set the status to OFF if status was ON.
            addressMatrix->status = 0;
        }
        else
        {   // Set the status to ON if status was OFF.
            addressMatrix->status = 1;
        }
    }
}

void pixel_Show(unsigned char red, unsigned char green, unsigned char blue)
{   // For the WS2812b, the order is High bit to low AND Green - Red - Blue.
    // Sending GREEN.
    SEND_COLOR_BIT(green, BIT7); SEND_COLOR_BIT(green, BIT6);
    SEND_COLOR_BIT(green, BIT5); SEND_COLOR_BIT(green, BIT4);
    SEND_COLOR_BIT(green, BIT3); SEND_COLOR_BIT(green, BIT2);
    SEND_COLOR_BIT(green, BIT1); SEND_COLOR_BIT(green, BIT0);
    // Sending RED.
    SEND_COLOR_BIT(red, BIT7); SEND_COLOR_BIT(red, BIT6);
    SEND_COLOR_BIT(red, BIT5); SEND_COLOR_BIT(red, BIT4);
    SEND_COLOR_BIT(red, BIT3); SEND_COLOR_BIT(red, BIT2);
    SEND_COLOR_BIT(red, BIT1); SEND_COLOR_BIT(red, BIT0);
    // Sending BLUE.
    SEND_COLOR_BIT(blue, BIT7); SEND_COLOR_BIT(blue, BIT6);
    SEND_COLOR_BIT(blue, BIT5); SEND_COLOR_BIT(blue, BIT4);
    SEND_COLOR_BIT(blue, BIT3); SEND_COLOR_BIT(blue, BIT2);
    SEND_COLOR_BIT(blue, BIT1); SEND_COLOR_BIT(blue, BIT0);
}

/*	Initial : 0/+-360 degrees :
 *          33 :  / - - - - - - - -  -  -  -  -  -  -  /
 * 			32 :  \ - - - - - - - -  -  -  -  -  -  -  \.
 * 			 1 :  - - - - - - - - -  -  -  -  -  -  -  /
 * Starting LED-> 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
 * Rotated : 90/-270 degrees :
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 3
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 2
 *       |   \   /   \   /   \   /   \   /   \  /  \  /  \  / | : 1
 *      256 225 224 193 192 161 160 129 128 97 96 65 64 33 32 1  <- Starting LED.
 * Rotated : 180/-180 degrees :
 *       \   -   -   -   -   -   -   -   -   -   -   -   -   -   -   \ : 224
 * 		/   -   -   -   -   -   -   -   -   -   -   -   -   -   -   / : 225
 * 		\   -   -   -   -   -   -   -   -   -   -   -   -   -   -   - : 256
 *      241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256
 * Rotated : 270/-90 degrees :
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 243
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 242
 *       \  /  \  /  \  /  \   /   \   /   \   /   \   /   \   / : 241
 *      16 17 48 49 80 81 112 113 144 145 176 177 208 209 240 241                      */
unsigned int pixel_RecoverPosition(unsigned char posX, unsigned char posY)
{	// Var. Dec. :
    xdata unsigned char ui8_newX = 0, ui8_newY = 0;
    xdata unsigned char ui8_X = 0, ui8_Y = 0;
    xdata unsigned int ui16_matOffset = 0;
    xdata unsigned int ui16_returnPos = 0;

    // Condition about starting from 1, instead of 0.
    if(posX == 0) { ui8_X = 1; } else { ui8_X = posX;}
    if(posY == 0) { ui8_Y = 1; } else { ui8_Y = posY;}

