KC5-BP/C8051F020-WS2812B/Matrix/ws2812_matrix.c
    switch(matrixDisplay.matrixView)
    {
        case 0:
        case 360:
        case (-360):
            // Condition about the Line being Even or not.
            // Then, by the Matrix routing, define how the WS281x must be adressed.
            if((posY % 2) == 0)
            {
                if(ui8_X <= MAX_COLU)
                {
                    ui8_newX = MAX_COLU - ui8_X;
                    ui16_matOffset = 0;
                }
                else
                {
                    if(ui8_X <= (2 * MAX_COLU))
                    {
                        ui8_newX = (2 * MAX_COLU) - ui8_X;
                        ui16_matOffset = MAX_COLU * MAX_LINE;
                    }
                    else
                    {
                        ui8_newX = (3 * MAX_COLU) - ui8_X;
                        ui16_matOffset = 2 * MAX_COLU * MAX_LINE;
                    }
                }
            }
            else
            {
                if(ui8_X <= MAX_COLU)
                {
                    ui8_newX = (ui8_X - 1);
                    ui16_matOffset = 0;
                }
                else
                {
                    if(ui8_X <= (2 * MAX_COLU))
                    {
                        ui8_newX = (ui8_X - MAX_COLU - 1);
                        ui16_matOffset = MAX_COLU * MAX_LINE;
                    }
                    else
                    {
                        ui8_newX = (ui8_X - (2 * MAX_COLU) - 1);
                        ui16_matOffset = 2 * MAX_COLU * MAX_LINE;
                    }
                }
            }
            ui16_returnPos = (((ui8_Y - 1) * MAX_COLU) + ui8_newX) + ui16_matOffset;
            break;


        case 90:
        case (-270):
            // Condition about the Line being Even or not.
            // Then, by the Matrix routing, define how the WS281x must be adressed.
            if((posX % 2) == 0)
            {
                ui8_newY = (MAX_LINE - 1) - posY;
            }
            else
            {
                ui8_newY = posY;
            }
            ui16_returnPos = (((posX - 1) * MAX_COLU) + ui8_newY);
            break;

        case 180:
        case (-180):
            // Condition about the Line being Even or not.
            // Then, by the Matrix routing, define how the WS281x must be adressed.
            if((posY % 2) == 0)
            {
                ui8_newX = MAX_COLU - ui8_X;
            }
            else
            {
                ui8_newX = (ui8_X - 1);
            }
            ui16_returnPos = (((ui8_Y - 1) * MAX_COLU) + ui8_newX);
            break;


        case 270:
        case (-90):
            // Condition about the Line being Even or not.
            // Then, by the Matrix routing, define how the WS281x must be adressed.
            if((posX % 2) == 0)
            {
                ui8_newY = (MAX_LINE - 1) - posY;
            }
            else
            {
                ui8_newY = posY;
            }
            ui16_returnPos = (((posX - 1) * MAX_COLU) + ui8_newY); // Checker les PosRecov en rotation.
            break;

        default :	/* State of every undefined case, so not supposed to come here. */	break;
    }
    return ui16_returnPos; // Return Pos.
}

//-------------------------------------------------------------------------------------->
void matrix_Show(pixel* addressMatrix)
{   // Var. Dec. :
    xdata unsigned int i;

    // Disable Timer to avoid interrupting Sending "Packets" :
    TR0 = 0;
    for(i = 0; i < MAX_LEDS; i++)
    {
        if(addressMatrix->status != 0)
        {
            pixel_Show(addressMatrix->colorPix.Red, addressMatrix->colorPix.Green, \
                        addressMatrix->colorPix.Blue);
        }
        else
        {
            pixel_Show(BRIGHT_MIN, BRIGHT_MIN, BRIGHT_MIN);
        }
        addressMatrix++; // Increase address for next position changes ..
    }
    // Enable / Re-activate Timer after "Packets" Sent :
    TR0 = 1;
}

void matrix_Off(pixel* addressMatrix)
{   // Var. Dec. :
    xdata unsigned int i;

    for(i = 0; i < MAX_LEDS; i++)
    {	// Clear ALL color at the original address ...
        pixel_Reset(addressMatrix, i);
    }
    matrix_Show(addressMatrix);
}

void matrix_ResetStatus(pixel* addressMatrix)
{   // Var. Dec. :
    xdata unsigned int i;

    for(i = 0; i < MAX_LEDS; i++)
    {   // Clear Status to keep color in the original address ...
        addressMatrix->status = 0;
        addressMatrix++; // Increase address for clearing next position.
    }
}

void matrix_Inverter(pixel* addressMatrix)
{   // Var. Dec. :
    xdata unsigned int i; // LED Position for filling Board of strip.
    xdata color tmpColor; // Color recovered to invert the actual strip's color.

    for(i = 0; i < MAX_LEDS; i++)   // First loop to find the first LED alight that
    {                                   // will give the colour to set for the
        if(pixel_GetStatus(addressMatrix, i) != 0)       // reversed status ..
        {   // color found => recovering and ending loop.
            tmpColor = pixel_GetColor(addressMatrix, i);
            break;
        }
    }
    for(i = 0; i < MAX_LEDS; i++)   // Second loop to toggle LEDs status.
    {
        if(pixel_GetStatus(addressMatrix, i) == 0)
        {
            pixel_Set(addressMatrix, tmpColor, i);
        }
        else
        {
            pixel_Reset(addressMatrix, i);
        }
    }
}

void matrix_ChainedLeds(pixel* addressMatrix, color newColor, \
                                               posType begin, posType end)
{	// Var. Dec. :
    xdata unsigned int i; // LED Position for filling Board of strip.

    for(i = 0; i < MAX_LEDS; i++)
    {
        if((i >= begin) && (i <= end))
        {
            pixel_Set(addressMatrix, newColor, i);
        }
        else { /* Before first use, don't forget to clear strip's status. */ }
    }
}

void matrix_SetTextPosition(unsigned char  column, unsigned char line)
{   // COLUMN validity ..
    //if(column < 1) Offset.column = 1;
    //if(column > MAX_COLU) Offset.column = MAX_COLU;
    //else Offset.column = column;
    // LINE validity ..
    //if(line < 1) Offset.line = 1;
    //if(line > MAX_COLU) Offset.line = MAX_LINE;
    //else Offset.line = line;

    // Need to find a way for getting 
    Offset.column = column;
    Offset.line = line;
}

