KC5-BP/C8051F020-WS2812B/Matrix/ws2812_matrix.c
void matrix_Print(pixel* addressMatrix, color newColor, const char* _CharToWrite, ...)
{	// Var. Dec. :
	xdata unsigned int i;	// Y and Filling
	xdata unsigned char j;	// X
	xdata unsigned char Cnt_Lin = 0;	// For Char with different : Line
	xdata unsigned char Cnt_Col = 0;	// For Char with different : Colu
	const char* cP_CharToPrint;	// Recover the actual char to print.
	xdata unsigned int NeoPix_Pos = 0;	// Position recovery from an int to
	xdata unsigned int CharReadOrga = 0;	// Organisation about Reading the Char depending on the Matrix' Orientation.
//
	for(cP_CharToPrint = _CharToWrite; *cP_CharToPrint != '\0'; cP_CharToPrint++)
	{
		switch(*cP_CharToPrint)
		{	// Height & Width of letters can be different so a first Switch..Case is necessary.
			// Letters : --------------------------------------------------->
			case 'A':	case 'B':	case 'C':	case 'D':	case 'E':   case 'F':
			case 'G':	case 'H':	case 'I':	case 'J':   case 'K':   case 'L':
			case 'N':	case 'O':	case 'P':   case 'Q':	case 'R':	case 'S':
			case 'T':	case 'U':   case 'X':	case 'Y':	case 'Z':
				Cnt_Col = 4;
				Cnt_Lin = 7;
				break;
			case 'M':	case 'V':	case 'W':
				Cnt_Col = 5;
				Cnt_Lin = 7;
				break;
			// Numbers + Style : ------------------------------------------->
			case '0':	case '1':	case '2':	case '3':	case '4':
			case '5':	case '6':	case '7':	case '8':	case '9':
				switch(matrixDisplay.txtFont)
				{
 					case numberClassic:
						Cnt_Col = 4;
						Cnt_Lin = 7;
						break;
					case numberTime:
						Cnt_Col = 5;
						Cnt_Lin = 7;
						break;
					case numberMob:
						Cnt_Col = 4;
						Cnt_Lin = 6;
						break;
					default :	/* State of every undefined case, so not supposed to come here. */	break;
				}
				break;
			// Special Char. : --------------------------------------------->
			case ' ':	case '.':   case ',':   case '!':
			case ':':	case '=':   case '*':   case '-':
			case '+':	case '%':   /*case '°':*/   case '/':
				Cnt_Col = 3;
				Cnt_Lin = 7;
				break;

         case '\'':
				Cnt_Col = 2;
				Cnt_Lin = 7;
				break;

        case '(':	case ')':   case '{':   case '}':
        case '[':	case ']':   case '~':   case '@':
        case '#':	case '&':
				Cnt_Col = 5;
				Cnt_Lin = 7;
				break;

        case '_':
				Cnt_Col = 4;
				Cnt_Lin = 7;
				break;

			case '^':
				Cnt_Col = 7;
				Cnt_Lin = 6;
				break;

			case '?':
				switch(matrixDisplay.txtFont)
				{
					case numberClassic:
						Cnt_Col = 4;
						Cnt_Lin = 7;
						break;
					case numberMob:
						Cnt_Col = 5;
						Cnt_Lin = 7;
						break;
					default :	/* State of every undefined case, so not supposed to come here. */	break;
				}
				break;

			default :	/* State of every undefined case, so not supposed to come here. */	break;
		}

		for(i = 0; i < Cnt_Lin; i++)
		{
			for(j = 0; j < Cnt_Col; j++)
			{	// Same Line :
				NeoPix_Pos = pixel_RecoverPosition((j+Offset.column), i+Offset.line);
				// Condition about possible value for displaying or not.
				if(NeoPix_Pos >= ((MAX_COLU * MAX_LINE) * MATRIX_NBR))
				{
					break;
				}
				else { /* Nothing. */ }
				// Switch about definning how the char Board must be read.
				switch(matrixDisplay.matrixView)
				{
					case 0:
					case 180:
					case 360:
					case (-180):
					case (-360):
						CharReadOrga = ((i * Cnt_Col) - j);
						break;
					case 90:
					case 270:
					case (-90):
					case (-270):
						CharReadOrga = (((i + 1) * Cnt_Col) - (j + 1));
						break;
					default :	/* State of every undefined case, so not supposed to come here. */	break;
				}

				switch(*cP_CharToPrint)
				{
					case 'A':
						addressMatrix[NeoPix_Pos].status = cBoard_A[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'B':
						addressMatrix[NeoPix_Pos].status = cBoard_B[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'C':
						addressMatrix[NeoPix_Pos].status = cBoard_C[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'D':
						addressMatrix[NeoPix_Pos].status = cBoard_D[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'E':
						addressMatrix[NeoPix_Pos].status = cBoard_E[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'F':
						addressMatrix[NeoPix_Pos].status = cBoard_F[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'G':
						addressMatrix[NeoPix_Pos].status = cBoard_G[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'H':
						addressMatrix[NeoPix_Pos].status = cBoard_H[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'I':
						addressMatrix[NeoPix_Pos].status = cBoard_I[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'J':
						addressMatrix[NeoPix_Pos].status = cBoard_J[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'K':
						addressMatrix[NeoPix_Pos].status = cBoard_K[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'L':
						addressMatrix[NeoPix_Pos].status = cBoard_L[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'M':
						addressMatrix[NeoPix_Pos].status = cBoard_M[OFF_CHAR_DIM_5X7 - CharReadOrga];
						break;
					case 'N':
						addressMatrix[NeoPix_Pos].status = cBoard_N[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'O':
						addressMatrix[NeoPix_Pos].status = cBoard_O[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'P': //
						addressMatrix[NeoPix_Pos].status = cBoard_P[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'Q':
						addressMatrix[NeoPix_Pos].status = cBoard_Q[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'R':
						addressMatrix[NeoPix_Pos].status = cBoard_R[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'S':
						addressMatrix[NeoPix_Pos].status = cBoard_S[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'T':
						addressMatrix[NeoPix_Pos].status = cBoard_T[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'U':
						addressMatrix[NeoPix_Pos].status = cBoard_U[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'V':
						addressMatrix[NeoPix_Pos].status = cBoard_V[OFF_CHAR_DIM_5X7 - CharReadOrga];
						break;
					case 'W':
						addressMatrix[NeoPix_Pos].status = cBoard_W[OFF_CHAR_DIM_5X7 - CharReadOrga];
						break;
					case 'X':
						addressMatrix[NeoPix_Pos].status = cBoard_X[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'Y':
						addressMatrix[NeoPix_Pos].status = cBoard_Y[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
					case 'Z':
						addressMatrix[NeoPix_Pos].status = cBoard_Z[OFF_CHAR_DIM_4X7 - CharReadOrga];
						break;
//
					case '0':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_0_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_0_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_0_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '1':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_1_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_1_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_1_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '2':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_2_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_2_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_2_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '3':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_3_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_3_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_3_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '4':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_4_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_4_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_4_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '5':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_5_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_5_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_5_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '6':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_6_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_6_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_6_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '7':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_7_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_7_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_7_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '8':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_8_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_8_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_8_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;
					case '9':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_9_Val[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberTime:
								addressMatrix[NeoPix_Pos].status = cBoard_9_Time[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_9_Mob[OFF_CHAR_DIM_4X6 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here. */	break;
						}
						break;

					case '.':
						addressMatrix[NeoPix_Pos].status = cBoard_Dot[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;
					case ',':
						addressMatrix[NeoPix_Pos].status = cBoard_Comma[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;
					case '!':
						addressMatrix[NeoPix_Pos].status = cBoard_ExclaMark[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;
					case '?':
						switch(matrixDisplay.txtFont)
						{
							case numberClassic:
								addressMatrix[NeoPix_Pos].status = cBoard_QuestMark[OFF_CHAR_DIM_4X7 - CharReadOrga];
								break;
							case numberMob:
								addressMatrix[NeoPix_Pos].status = cBoard_QuestMark_Mob[OFF_CHAR_DIM_5X7 - CharReadOrga];
								break;
							default :	/* State of every undefined case, so not supposed to come here.	*/break;
						}
						break;
					case ':':
						addressMatrix[NeoPix_Pos].status = cBoard_Colon[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;

					case '^':
						//addressMatrix[NeoPix_Pos].status = cBoard_Heart[OFF_CHAR_DIM_7X6 - CharReadOrga];
						break;

					case '\'':
						addressMatrix[NeoPix_Pos].status = cBoard_Apost[OFF_CHAR_DIM_2X7 - CharReadOrga];
						break;

					case '*':
						addressMatrix[NeoPix_Pos].status = cBoard_Asterisk[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;

					case ' ':
						addressMatrix[NeoPix_Pos].status = cBoard_Space[OFF_CHAR_DIM_3X7 - CharReadOrga];
						break;

					case '\n':
						Offset.column = 1;
						Offset.line -= 8;	// Decrease Line of Height + 1 line to make a space.
						//Offset.line = 3;
						break;
					
					default :	/* State of every undefined case, so not supposed to come here. */	break;
				}
				
				// Coloring only One char at a Time :
				if(addressMatrix[NeoPix_Pos].status != 0)
				{
                    addressMatrix[NeoPix_Pos].colorPix = newColor;
					//addressMatrix[NeoPix_Pos].colorPix.Red = newColor.Red;
					//addressMatrix[NeoPix_Pos].colorPix.Green = newColor.Green;
					//addressMatrix[NeoPix_Pos].colorPix.Blue = newColor.Blue;
				}
				else
				{
					addressMatrix[NeoPix_Pos].colorPix.Red = BRIGHT_MIN;
					addressMatrix[NeoPix_Pos].colorPix.Green = BRIGHT_MIN;
					addressMatrix[NeoPix_Pos].colorPix.Blue = BRIGHT_MIN;
				}
			}
		}
         // Space auto management while entering multiple char.
		if(*cP_CharToPrint != '\n')
		{
			// Position Increment on X :
			Offset.column += (Cnt_Col + 1);
		}
		else
		{ /* Nothin', avoid increase Col. after a \n. */ }
	}
}